uhnp/src/DataProcessors/тн_ПодключаемыйМодульДиадок/тн_ПодключаемыйМодульДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ПодключаемыйМодульДиадок</name>
  <comment>// Мещеряков Алексей 28.11.2023 Выполнение задач №000047617</comment>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/НоменклатураКонтрагентовБЭД/НоменклатураКонтрагентовБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураКонтрагентовБЭД</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКод</name>
    <comment>ОКЕИ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторНоменклатурыСервиса</name>
    <comment>1С: Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторХарактеристикиСервиса</name>
    <comment>1С: Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.НоменклатураБЭД</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатурыБЭД</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>DefinedType.УпаковкаНоменклатурыБЭД</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодКомбинации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипНоменклатурыФНС</name>
    <type>
      <types>EnumRef.ТипыНоменклатурыФНС</types>
    </type>
  </resources>
  <resources>
    <name>КодНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоКТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтранаПроисхожденияКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркируемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ХешПравилаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешНаименования</name>
    <comment>MD5 хеш от наименования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешАртикула</name>
    <comment>MD5 хеш от артикула</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешКодаНоменклатуры</name>
    <comment>MD5 хеш от кода номенклатуры</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешШтрихкода</name>
    <comment>MD5 хеш от штрихкода</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладелецНоменклатурыБЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЯвляетсяОбъектомЦБ</name>
    <comment>Выполнение задач №000042800</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ПодключаемыйМодульДиадок/Forms/СозданиеНоменклатурыИзЭД/Module.bsl
#Область Обработчики_Команд_Формы 

&НаКлиенте
Процедура ЗаполнитьПоТекущейСтрокеНаСервере()
	Если Элементы.ТаблицаПервоначальная.ТекущиеДанные <> Неопределено Тогда 
		ТекДанные   = Элементы.ТаблицаПервоначальная.ТекущиеДанные;		
		ИдентификаторСтрокиИсходный = ТекДанные.ИдентификаторСтроки;
		
		Отбор = Новый Структура("ИдентификаторНоменклатуры",ТекДанные.ИдентификаторСтроки);
		СтрокиИсходные = ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого НоменклатураСтр Из ТаблицаПервоначальная Цикл
		Если НоменклатураСтр.ИдентификаторСтроки <> ИдентификаторСтрокиИсходный Тогда
			
			ЗаполнитьЗначенияСвойств(НоменклатураСтр,ТекДанные,,"Номенклатура,ИдентификаторСтроки,Описание,СтавкаНДС,ЕдиницаИзмеренияКод,ЕдиницаИзмерения,Наименование,Идентификатор,Артикул");	
						
			ОчиститьСтрокиПоИдентификатору(НоменклатураСтр.ИдентификаторСтроки);
			
			Для Каждого  Стр Из СтрокиИсходные Цикл
				НовДоп = ДополнительныеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(НовДоп,Стр);
				НовДоп.ИдентификаторНоменклатуры = НоменклатураСтр.ИдентификаторСтроки;  
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТекущейСтроке(Команда)
	ЗаполнитьПоТекущейСтрокеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_Формы 

 &НаКлиенте
Процедура ТаблицаПервоначальнаяПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаПервоначальная.ТекущиеДанные <> Неопределено Тогда 
		
		ТекДанные = Элементы.ТаблицаПервоначальная.ТекущиеДанные;
		Отбор = Новый ФиксированнаяСтруктура("ИдентификаторНоменклатуры",ТекДанные.ИдентификаторСтроки);
		Элементы.ДополнительныеРеквизиты.ОтборСтрок = Отбор;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресВХ") Тогда
		АдресВХ = Параметры.АдресВХ;
		ТаблицаСопоставления = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
		
		Для Каждого Стр Из ТаблицаСопоставления	Цикл
			Если Не ЗначениеЗаполнено(Стр.Номенклатура) И Не ЕстьСопоставление(Стр) Тогда
				НовСтрока = ТаблицаПервоначальная.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока,Стр);
				ЗаполнитьЗначенияСвойств(НовСтрока,Стр.НоменклатураКонтрагента);
				НовСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			КонецЕсли;
		КонецЦикла;	
				
	КонецЕсли;	
		
КонецПроцедуры 

&НаСервере
Функция ЕстьСопоставление(ДанныеЭД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКонтрагентовБЭД.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	               |ГДЕ
	               |	НоменклатураКонтрагентовБЭД.Владелец = &Владелец
	               |	И НоменклатураКонтрагентовБЭД.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Владелец",ДанныеЭД.Контрагент);
	Запрос.УстановитьПараметр("Идентификатор",ДанныеЭД.НоменклатураКонтрагента.Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина; 
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции
	
&НаКлиенте
Процедура ТаблицаПервоначальнаяВидНоменклатурыПриИзменении(Элемент) 
	
	Если Элементы.ТаблицаПервоначальная.ТекущиеДанные <> Неопределено Тогда   
		
		ТекДанные = Элементы.ТаблицаПервоначальная.ТекущиеДанные;
		
		ОчиститьСтрокиПоИдентификатору(ТекДанные.ИдентификаторСтроки);
		
		ТаблицаПервоначальнаяВидНоменклатурыПриИзмененииНаСервере(ТекДанные.ИдентификаторСтроки,ТекДанные.ВидНоменклатуры);
				
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ТаблицаПервоначальнаяВидНоменклатурыПриИзмененииНаСервере(ИдентификаторСтроки,ВидНоменклатуры)
	
	ТаблицаКонтроля = ПолучитьТаблицуконтроля(ВидНоменклатуры); 
	ТЗПервоначальная = ДанныеФормыВЗначение(ТаблицаПервоначальная,Тип("ТаблицаЗначений"));
	
	Для каждого Стр Из ТаблицаКонтроля Цикл 
		
		РеквизитЕсть = ТЗПервоначальная.Колонки.Найти(Стр.НаименованиеПоля);
		
		Если Не РеквизитЕсть = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовДоп = ДополнительныеРеквизиты.Добавить();
		НовДоп.ИдентификаторНоменклатуры = ИдентификаторСтроки; 
		НовДоп.НаименованиеПоля          = Стр.НаименованиеПоля; 

		Реквизит = Метаданные.Справочники.Номенклатура.Реквизиты.Найти(Стр.НаименованиеПоля);
		ЗначениеПоУмолчанию = Реквизит.Тип.ПривестиЗначение("");

		НовДоп.ЗначениеПоля				 = ЗначениеПоУмолчанию;
	КонецЦикла;	
		
КонецПроцедуры	

&НаСервере
Процедура ОчиститьСтрокиПоИдентификатору(ИдентификаторСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторНоменклатуры",ИдентификаторСтроки);
	
	СтрокиДляУдаления = ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из СтрокиДляУдаления Цикл
		ДополнительныеРеквизиты.Удалить(Стр);		
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуконтроля(ВидНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыНоменклатурыРеквизитыДляКонтроляНоменклатуры.ИмяРеквизита КАК НаименованиеПоля,
	               |	ВидыНоменклатурыРеквизитыДляКонтроляНоменклатуры.ПредставлениеРеквизита КАК ПредставлениеРеквизита
	               |ИЗ
	               |	Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК ВидыНоменклатурыРеквизитыДляКонтроляНоменклатуры
	               |ГДЕ
	               |	ВидыНоменклатурыРеквизитыДляКонтроляНоменклатуры.Ссылка = &Ссылка
	               |	И ВидыНоменклатурыРеквизитыДляКонтроляНоменклатуры.ЗаполнятьОбязательно = ИСТИНА";
	Запрос.УстановитьПараметр("Ссылка",ВидНоменклатуры);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
#КонецОбласти

#Область Создание_Сопоставление_Номенклатуры

&НаСервере
Процедура СоздатьНоменклатурыНаСервере()
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаПервоначальная Цикл
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) Тогда
			Продолжить;
		КонецЕсли; 
					
		Индекс = ТаблицаПервоначальная.Индекс(СтрокаНоменклатуры);
		
		Если Не ОбязательныеПоляЗаполнены(СтрокаНоменклатуры,Индекс+1) Тогда 
			Продолжить;
		КонецЕсли;	
		
		НоваяНоменклатура = СоздатьНоменклатуруНаСервере(СтрокаНоменклатуры,Индекс+1);		
		
		Если ЗначениеЗаполнено(НоваяНоменклатура) Тогда
			СтрокаНоменклатуры.Номенклатура = НоваяНоменклатура; 
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ОбязательныеПоляЗаполнены(СтрокаНоменклатуры,НомерСтроки)
	
	СтрокаПеречисленияПолей = "";
	
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.Наименование) Тогда
		СтрокаПеречисленияПолей = "Наименование " + Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.ВидНоменклатуры) Тогда
		СтрокаПеречисленияПолей = СтрокаПеречисленияПолей + "Вид номенклатуры" + Символы.ПС;;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.РодительНоменклатуры) Тогда
		СтрокаПеречисленияПолей = СтрокаПеречисленияПолей + "Группа номенклатуры" + Символы.ПС;;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторНоменклатуры",СтрокаНоменклатуры.ИдентификаторСтроки);
	
	СтрокиДляЗаполнения = ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из СтрокиДляЗаполнения Цикл
		Если Не ЗначениеЗаполнено(Стр.ЗначениеПоля) Тогда
			СтрокаПеречисленияПолей = СтрокаПеречисленияПолей + "," +Стр.НаименованиеПоля + " "+ Символы.ПС;;
		КонецЕсли;	
	КонецЦикла;	   
	
	Если ЗначениеЗаполнено(СтрокаПеречисленияПолей) Тогда
		ТекстСообщения = СтрШаблон("Не удалось создать номенклатуру по строке %1. Не все обязательные поля заполнены: %2",НомерСтроки,СтрокаПеречисленияПолей);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);						
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;	
Конецфункции	

&НаСервере
Процедура ЗаполнитьСоответствиеНоменклатуры1с(НоменклатураКонтрагента,НоменклатураИБ,НомерСтроки)   
	
	Набор = РегистрыСведений.НоменклатураКонтрагентовБЭД.СоздатьНаборЗаписей();
	Набор.Отбор.Владелец.Установить(НоменклатураКонтрагента.Контрагент);
	Набор.Отбор.Идентификатор.Установить(НоменклатураКонтрагента.Идентификатор);
	
	Запись = Набор.Добавить();
	
	ЗаполнитьЗначенияСвойств(Запись, НоменклатураКонтрагента); 
	
	Запись.Владелец 		= НоменклатураКонтрагента.Контрагент;
	Запись.Номенклатура 	= НоменклатураИБ;
	
	Попытка
		Набор.Записать();
	Исключение
	   	ТекстСообщения = СтрШаблон("Не удалось сопоставить номенклатуру по строке %1 по причине: %2%3",НомерСтроки,Символы.ПС,ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	КонецПопытки  
	
КонецПроцедуры	

&НаСервере
Функция СоздатьНоменклатуруНаСервере(ДанныеНоменклатуры,НомерСтроки)
	
	ЕдиницаПоКлассификатору = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмеренияКод) Тогда
		
		ЕдиницаПоКлассификатору = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(ДанныеНоменклатуры.ЕдиницаИзмеренияКод);
		
	КонецЕсли;
	
	Если ЕдиницаПоКлассификатору = Неопределено 
		И ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
		
		ЕдиницаПоКлассификатору = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(ДанныеНоменклатуры.ЕдиницаИзмерения, Истина);
		
	КонецЕсли;
		
	НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	НоменклатураОбъект.ВидНоменклатуры    = ДанныеНоменклатуры.ВидНоменклатуры;

	Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НоменклатураОбъект);
	
	НоменклатураОбъект.УстановитьНовыйКод();	
	
	НоменклатураОбъект.ГруппаФинансовогоУчета = ДанныеНоменклатуры.ГФУ;
	
	НоменклатураОбъект.ЕдиницаИзмерения   = ?(ЗначениеЗаполнено(ЕдиницаПоКлассификатору), ЕдиницаПоКлассификатору, НоменклатураОбъект.ЕдиницаИзмерения);
	НоменклатураОбъект.Родитель           = ДанныеНоменклатуры.РодительНоменклатуры;
	НоменклатураОбъект.Наименование       = ДанныеНоменклатуры.Наименование;
	НоменклатураОбъект.НаименованиеПолное = ДанныеНоменклатуры.Наименование;
	НоменклатураОбъект.Артикул            = ДанныеНоменклатуры.Артикул;
	
	ЗаполнитьРеквизитыКонтроля(НоменклатураОбъект,ДанныеНоменклатуры.ИдентификаторСтроки);
	// НАЧАЛО Мещеряков Алексей 20.05.2025 Выполнение задач №000053747	
	//СтавкаНДС = ОбменССайтамиУТ.СтавкаНДСПоЗначениюПриЗагрузке(СтрЗаменить(ДанныеНоменклатуры.СтавкаНДС,"%",""));
	
	СоответствиеСтавокНДС = УчетНДСРФ.СоответствиеСтавокНДССтроковымЗначениям();
	СтавкаНДС = ОбменССайтамиУТ.СтавкаНДСПоЗначениюПриЗагрузке(СоответствиеСтавокНДС,СтрЗаменить(ДанныеНоменклатуры.СтавкаНДС,"%",""));
	// КОНЕЦ Мещеряков Алексей 20.05.2025 Выполнение задач №000053747
	
	НоменклатураОбъект.СтавкаНДС = СтавкаНДС;
		
	Попытка
		НоменклатураОбъект.Записать();
	Исключение
		ТекстСообщения = СтрШаблон("Не удалось создать номенклатуру по строке %1 по причине: %2%3",НомерСтроки,Символы.ПС,ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	Конецпопытки;	
	
	Возврат НоменклатураОбъект.Ссылка;		
КонецФункции	

&НаСервере
Процедура ЗаполнитьРеквизитыКонтроля(НоменклатураОбъект,ИдентификаторСтроки)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторНоменклатуры",ИдентификаторСтроки);
	
	СтрокиДляЗаполнения = ДополнительныеРеквизиты.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из СтрокиДляЗаполнения Цикл
		НоменклатураОбъект[Стр.НаименованиеПоля] = Стр.ЗначениеПоля;			
	КонецЦикла;		
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	СоздатьНоменклатурыНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СопоставитьНаСервере()
		
	Для Каждого СтрокаНоменклатуры Из ТаблицаПервоначальная Цикл
					
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) Тогда
			Индекс = ТаблицаПервоначальная.Индекс(СтрокаНоменклатуры);			
			ЗаполнитьСоответствиеНоменклатуры1с(СтрокаНоменклатуры,СтрокаНоменклатуры.Номенклатура,Индекс+1); 			
		КонецЕсли;	
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	СопоставитьНаСервере();
КонецПроцедуры

#КонецОбласти
